nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/common/pin_mux/cm33_core0/pin_mux.h
#define IOPCTL_PIO_ANAMUX_EN 0x0200u      /*!<@brief Analog mux is enabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitADCPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FUNC5 0x05u            /*!<@brief Selects pin function 5 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDMICPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FUNC3 0x03u            /*!<@brief Selects pin function 3 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSCTimerPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO1_11 (number AD22), BT_UART_RXD
  @{ */
/* Routed pin properties */
#define BOARD_INITBT_UARTPINS_BT_UART_RXD_PERIPHERAL LP_FLEXCOMM2   /*!<@brief Peripheral name */
#define BOARD_INITBT_UARTPINS_BT_UART_RXD_SIGNAL P0                 /*!<@brief Signal name */
#define BOARD_INITBT_UARTPINS_BT_UART_RXD_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITBT_UARTPINS_BT_UART_RXD_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITBT_UARTPINS_BT_UART_RXD_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                                    /* @} */

/*! @name PIO1_12 (number AE22), BT_UART_TXD
  @{ */
/* Routed pin properties */
#define BOARD_INITBT_UARTPINS_BT_UART_TXD_PERIPHERAL LP_FLEXCOMM2   /*!<@brief Peripheral name */
#define BOARD_INITBT_UARTPINS_BT_UART_TXD_SIGNAL P1                 /*!<@brief Signal name */
#define BOARD_INITBT_UARTPINS_BT_UART_TXD_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITBT_UARTPINS_BT_UART_TXD_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITBT_UARTPINS_BT_UART_TXD_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                                    /* @} */

/*! @name PIO1_14 (number AE24), BT_UART_RTS
  @{ */
/* Routed pin properties */
#define BOARD_INITBT_UARTPINS_BT_UART_RTS_PERIPHERAL LP_FLEXCOMM2   /*!<@brief Peripheral name */
#define BOARD_INITBT_UARTPINS_BT_UART_RTS_SIGNAL P2                 /*!<@brief Signal name */
#define BOARD_INITBT_UARTPINS_BT_UART_RTS_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITBT_UARTPINS_BT_UART_RTS_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITBT_UARTPINS_BT_UART_RTS_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                                    /* @} */

/*! @name PIO1_15 (coord Y21), BT_UART_CTS
  @{ */
/* Routed pin properties */
#define BOARD_INITBT_UARTPINS_BT_UART_CTS_PERIPHERAL LP_FLEXCOMM2   /*!<@brief Peripheral name */
#define BOARD_INITBT_UARTPINS_BT_UART_CTS_SIGNAL P3                 /*!<@brief Signal name */
#define BOARD_INITBT_UARTPINS_BT_UART_CTS_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITBT_UARTPINS_BT_UART_CTS_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITBT_UARTPINS_BT_UART_CTS_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBT_UARTPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

